Autodesk.Revit.DB.WallFoundation.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a new wall foundation within the project.
document:
The document.
typeId:
The id of the wall foundation type of the newly created wall foundation.
wallId:
The id of the host wall of the newly created wall foundation.
Returns:
If successful, returns the newly created wall foundation, null otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
typeId is not a valid WallFoundationType id.
-or-
wallId does not refer to a valid wall.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.WallFoundation.WallId
Returns the id of the host wall.
Since:
2016

Autodesk.Revit.DB.WallFoundation
An object that represents a wall foundation element.
Since:
2016